app/controllers/account_transactions_controller.rb

  def show_transactions
    flash[:notice] = "Successfully Saved"

    @atd_credits = AccountTranDetail.where(:id => params[:atd_credit_id].split(",")) if !params[:atd_credit_id].blank?
---
SELECT `account_tran_details`.* FROM `account_tran_details` WHERE `account_tran_details`.`id` = 10 LIMIT 1

  def member_transaction
    @groups =Group.order("name")
---
SELECT `groups`.* FROM `groups` ORDER BY name

  def load_members
  	@group = Group.find(params[:group_id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def save_member_transaction
   credit_trans_arr = []
   debit_trans_arr = []
   for key in params[:account_tran_detail].keys
     user_account = User.find(params[:member][key][:id]).account
     group_account = Group.find(params[:group][:id]).account
   	 #inflow
   	 amount_hash = {:saving => params[:account_tran_detail][key][:saving].to_f, :due => params[:account_tran_detail][key][:due].to_f, :principle_credit => params[:account_tran_detail][key][:principle_credit].to_f, :interest_credit => params[:account_tran_detail][key][:interest_credit].to_f, :other_amount => params[:account_tran_detail][key][:other_amount].to_f}
     if amount_hash.values.any?{|v| v > 0 }
	     atd_credit = AccountTranDetail.new
	     atd_credit.save_tranction(user_account.id, group_account.id, params[:transaction_date].to_date, amount_hash)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `account_tran_details` (`created_at`, `due`, `from_account_id`, `from_outs_balance`, `interest_credit`, `other_amount`, `principle_credit`, `principle_debit`, `saving`, `to_account_id`, `to_outs_balance`, `transaction_date`, `updated_at`) VALUES ('2012-12-17 18:51:26', 10, 1, 0, 20, 2, 0, 0, 1000, 3, 0, NULL, '2012-12-17 18:51:26')
UPDATE `account_tran_details` SET `from_outs_balance` = 1000, `updated_at` = '2012-12-17 19:15:03' WHERE `account_tran_details`.`id` = 18
UPDATE `accounts` SET `outstanding_balance` = 2000, `updated_at` = '2012-12-17 19:10:27' WHERE `accounts`.`id` = 1

  def group_transaction
    @groups =Group.order("name")
---
SELECT `groups`.* FROM `groups` ORDER BY name

  def save_group_transaction
    group_account = Group.find(params[:group][:id]).account
    selected_group_account = Group.find(params[:selected][:group_id]).account
    #inflow
    amount_hash = {:principle_credit => params[:account_tran_detail][:principle_credit].to_f, :interest_credit => params[:account_tran_detail][:interest_credit].to_f, :other_amount => params[:account_tran_detail][:other_amount].to_f}
    if amount_hash.values.any?{|v| v > 0 }
      @atd_credit = AccountTranDetail.new
      @atd_credit.save_tranction(selected_group_account.id, group_account.id, params[:transaction_date].to_date, amount_hash)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 3 LIMIT 1
INSERT INTO `account_tran_details` (`created_at`, `due`, `from_account_id`, `from_outs_balance`, `interest_credit`, `other_amount`, `principle_credit`, `principle_debit`, `saving`, `to_account_id`, `to_outs_balance`, `transaction_date`, `updated_at`) VALUES ('2012-12-18 03:15:01', 0, 3, 0, 0, 0, 0, 4000, 0, 4, 0, NULL, '2012-12-18 03:15:01')
UPDATE `account_tran_details` SET `from_outs_balance` = -1000, `updated_at` = '2012-12-18 03:18:32' WHERE `account_tran_details`.`id` = 22
UPDATE `accounts` SET `outstanding_balance` = -1000, `updated_at` = '2012-12-18 03:18:32' WHERE `accounts`.`id` = 3

  def bank_transaction
    @groups = Group.order("name")
---
SELECT `groups`.* FROM `groups` ORDER BY name

  def load_banks
    @banks = Bank.order("account_number")
---
SELECT `banks`.* FROM `banks` ORDER BY account_number

  def save_bank_transaction
    group_account = Group.find(params[:group][:id]).account
    bank_account = Bank.find(params[:bank][:id]).account
    #inflow
    amount_hash = {:principle_credit => params[:account_tran_detail][:principle_credit].to_f, :other_amount => params[:account_tran_detail][:other_amount].to_f}
    if amount_hash.values.any?{|v| v > 0 }
      @atd_credit = AccountTranDetail.new
      @atd_credit.save_tranction(bank_account.id, group_account.id, params[:transaction_date].to_date, amount_hash)
---
SELECT `banks`.* FROM `banks` WHERE `banks`.`id` = 1 LIMIT 1
INSERT INTO `account_tran_details` (`created_at`, `due`, `from_account_id`, `interest_credit`, `other_amount`, `principle_credit`, `principle_debit`, `saving`, `to_account_id`, `updated_at`) VALUES ('2012-12-12 19:44:19', 0, 6, 0, 0, 1000, 0, 0, 3, '2012-12-12 19:44:19')