app/controllers/banks_controller.rb

SELECT `banks`.* FROM `banks` ORDER BY bank_name
---
  def index
  	@banks = Bank.order("bank_name")

INSERT INTO `banks` (`account_name`, `account_number`, `bank_name`, `branch`, `created_at`, `updated_at`) VALUES (0, 998652, 'UCO', 0, '2012-12-08 17:27:30', '2012-12-08 17:27:30')
---
  def create
  	@bank = Bank.new(params[:bank])
  	if @bank.save

SELECT `banks`.* FROM `banks` WHERE `banks`.`id` = 1 LIMIT 1
---
  def edit
  	@bank = Bank.find(params[:id])

SELECT `banks`.* FROM `banks` WHERE `banks`.`id` = 1 LIMIT 1
UPDATE `banks` SET `branch` = 'SVG', `account_name` = 'Govind', `updated_at` = '2012-12-08 17:43:30' WHERE `banks`.`id` = 1
---
  def update
  	@bank = Bank.find(params[:id])
  	if @bank.update_attributes(params[:bank])