app/controllers/groups_controller.rb

  def index
  	@groups = Group.order("name")
---
SELECT `groups`.* FROM `groups` ORDER BY name

  def create
  	@group = Group.new(params[:group])
  	if @group.save
---
INSERT INTO `groups` (`created_at`, `name`, `updated_at`) VALUES ('2012-12-08 16:39:48', 'Group1', '2012-12-08 16:39:48')

  def update
  	@group = Group.find(params[:id])
  	if @group.update_attributes(params[:group])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
UPDATE `groups` SET `name` = 'Group2', `updated_at` = '2012-12-08 17:13:09' WHERE `groups`.`id` = 1

  def destroy
  	@group = Group.find(params[:id])
  	@group.destroy
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
DELETE FROM `groups` WHERE `groups`.`id` = 1