app/controllers/reports_controller.rb

SELECT `groups`.* FROM `groups` ORDER BY name
---
  def loan_details
  	@groups =Group.order("name")

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def load_loan_details
  	@group = Group.find(params[:group_id])