app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY first_name
---
  def list
  	@users = User.order("first_name")

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `groups`.* FROM `groups` ORDER BY name
---
  def edit
  	@user = User.find(params[:id])
    @groups = Group.order("name")

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `dob` = '1985-04-13', `updated_at` = '2012-12-08 18:48:47' WHERE `users`.`id` = 1
SELECT `groups_users`.* FROM `groups_users` WHERE `groups_users`.`user_id` = 1 LIMIT 1
INSERT INTO `groups_users` (`created_at`, `group_id`, `is_admin`, `updated_at`, `user_id`) VALUES ('2012-12-17 18:49:28', 1, 0, '2012-12-17 18:49:28', 1)
---
  def update
  	@user = User.find(params[:id])
  	if @user.update_attributes(params[:user])
      if @user.groups_user
        @user.groups_user.update_attributes(:group_id => params[:selected][:group_id])
      else
        groups_user = GroupsUser.new(:user_id => @user.id, :group_id => params[:selected][:group_id])
        groups_user.save